# LCC Traning Pandas

In [1]:
import pandas as pd
import os

In [4]:
file_path = os.path.join(os.getcwd(),"csv_data","weather_data.csv")

In [5]:
file_path

'C:\\Users\\Roshan KC\\Downloads\\6months_datascience_challange\\csv_data\\weather_data.csv'

In [6]:
df = pd.read_csv(file_path,skiprows=2)
#here we are using skip rows because 2 have garbage values in weather data in first two rows

In [8]:
df.head(2)

        day    temperature windspeed  event
0  1/1/2017             32         6   Rain
1  1/4/2017  not available         9  Sunny

In [9]:
df.columns

Index(['day', 'temperature', 'windspeed', 'event'], dtype='object')

In [11]:
df.values

array([['1/1/2017', '32', '6', 'Rain'],
       ['1/4/2017', 'not available', '9', 'Sunny'],
       ['1/5/2017', '-1', 'not measured', 'Snow'],
       ['1/6/2017', 'not available', '7', 'no event'],
       ['1/7/2017', '32', 'not measured', 'Rain'],
       ['1/8/2017', 'not available', 'not measured', 'Sunny'],
       ['1/9/2017', 'not available', 'not measured', 'no event'],
       ['1/10/2017', '34', '8', 'Cloudy'],
       ['1/11/2017', '-4', '-1', 'Snow'],
       ['1/12/2017', '26', '12', 'Sunny'],
       ['1/13/2017', '12', '12', 'Rainy'],
       ['1/11/2017', '-1', '12', 'Snow'],
       ['1/14/2017', '40', '-1', 'Sunny']], dtype=object)

In [12]:
df.dtypes

day            object
temperature    object
windspeed      object
event          object
dtype: object

In [15]:
df.shape # gives rows and columns

(13, 4)

## we can use df['column_name'] = list_values(must be equal to of rows) to add new colums od data

In [21]:
address = ['Delhi', 'Bangalore', 'Chennai', 'Patna','Delhi', 'Bangalore', 'Chennai', 'Patna','Delhi', 'Bangalore', 'Chennai', 'Patna','KTM']
df['address'] = address

In [22]:
df

          day    temperature     windspeed     event    address
0    1/1/2017             32             6      Rain      Delhi
1    1/4/2017  not available             9     Sunny  Bangalore
2    1/5/2017             -1  not measured      Snow    Chennai
3    1/6/2017  not available             7  no event      Patna
4    1/7/2017             32  not measured      Rain      Delhi
5    1/8/2017  not available  not measured     Sunny  Bangalore
6    1/9/2017  not available  not measured  no event    Chennai
7   1/10/2017             34             8    Cloudy      Patna
8   1/11/2017             -4            -1      Snow      Delhi
9   1/12/2017             26            12     Sunny  Bangalore
10  1/13/2017             12            12     Rainy    Chennai
11  1/11/2017             -1            12      Snow      Patna
12  1/14/2017             40            -1     Sunny        KTM

In [24]:
df.info

<bound method DataFrame.info of           day    temperature     windspeed     event    address
0    1/1/2017             32             6      Rain      Delhi
1    1/4/2017  not available             9     Sunny  Bangalore
2    1/5/2017             -1  not measured      Snow    Chennai
3    1/6/2017  not available             7  no event      Patna
4    1/7/2017             32  not measured      Rain      Delhi
5    1/8/2017  not available  not measured     Sunny  Bangalore
6    1/9/2017  not available  not measured  no event    Chennai
7   1/10/2017             34             8    Cloudy      Patna
8   1/11/2017             -4            -1      Snow      Delhi
9   1/12/2017             26            12     Sunny  Bangalore
10  1/13/2017             12            12     Rainy    Chennai
11  1/11/2017             -1            12      Snow      Patna
12  1/14/2017             40            -1     Sunny        KTM>

# checking the null values in the pandas dataframe

In [25]:
df.isnull()

      day  temperature  windspeed  event  address
0   False        False      False  False    False
1   False        False      False  False    False
2   False        False      False  False    False
3   False        False      False  False    False
4   False        False      False  False    False
5   False        False      False  False    False
6   False        False      False  False    False
7   False        False      False  False    False
8   False        False      False  False    False
9   False        False      False  False    False
10  False        False      False  False    False
11  False        False      False  False    False
12  False        False      False  False    False

In [28]:
df.isnull().sum()

day            0
temperature    0
windspeed      0
event          0
address        0
dtype: int64

##  Note: isnull finds true or flas and return false for NaN and sum() fucntion counts the nanm

In [30]:
df

          day    temperature     windspeed     event    address
0    1/1/2017             32             6      Rain      Delhi
1    1/4/2017  not available             9     Sunny  Bangalore
2    1/5/2017             -1  not measured      Snow    Chennai
3    1/6/2017  not available             7  no event      Patna
4    1/7/2017             32  not measured      Rain      Delhi
5    1/8/2017  not available  not measured     Sunny  Bangalore
6    1/9/2017  not available  not measured  no event    Chennai
7   1/10/2017             34             8    Cloudy      Patna
8   1/11/2017             -4            -1      Snow      Delhi
9   1/12/2017             26            12     Sunny  Bangalore
10  1/13/2017             12            12     Rainy    Chennai
11  1/11/2017             -1            12      Snow      Patna
12  1/14/2017             40            -1     Sunny        KTM

# to set day as indexm

In [34]:
new_weather_data = df.set_index('day')

In [39]:
new_weather_data

             temperature     windspeed     event    address
day
1/1/2017              32             6      Rain      Delhi
1/4/2017   not available             9     Sunny  Bangalore
1/5/2017              -1  not measured      Snow    Chennai
1/6/2017   not available             7  no event      Patna
1/7/2017              32  not measured      Rain      Delhi
1/8/2017   not available  not measured     Sunny  Bangalore
1/9/2017   not available  not measured  no event    Chennai
1/10/2017             34             8    Cloudy      Patna
1/11/2017             -4            -1      Snow      Delhi
1/12/2017             26            12     Sunny  Bangalore
1/13/2017             12            12     Rainy    Chennai
1/11/2017             -1            12      Snow      Patna
1/14/2017             40            -1     Sunny        KTM

In [40]:
new_weather_data['temperature'].plot()

TypeError: no numeric data to plot

##  yo error aaunu ko karan chai , diyeko CSV ma numeric data nahunu ho , please use another CSV with Nan instead of string message to get plot

# to select only one columnmm

In [42]:
new_weather_data['event']

day
1/1/2017         Rain
1/4/2017        Sunny
1/5/2017         Snow
1/6/2017     no event
1/7/2017         Rain
1/8/2017        Sunny
1/9/2017     no event
1/10/2017      Cloudy
1/11/2017        Snow
1/12/2017       Sunny
1/13/2017       Rainy
1/11/2017        Snow
1/14/2017       Sunny
Name: event, dtype: object

#  particular row particular column accessing

In [52]:
nwd = df # df bhaneko purano weather data which was imported

In [54]:
nwd.loc[0,'event']

'Rain'

# .loc[row_index,"column_name"] is appropriate suntax and loc is used to locate

In [55]:
file_path = os.path.join(os.getcwd(),"csv_data","appointment_schedule.csv")

In [56]:
file_path

'C:\\Users\\Roshan KC\\Downloads\\6months_datascience_challange\\csv_data\\appointment_schedule.csv'

In [57]:
df = pd.read_csv(file_path)

In [58]:
df

,name,appointment_made_date,app_start_date,app_end_date,visitee_namelast,visitee_namefirst,meeting_room,description
0,Joshua T. Blanton,2014-12-18T00:00:00,1/6/15 9:30,1/6/15 23:59,NaN,potus,west wing,JointService Military Honor Guard
1,Jack T. Gutting,2014-12-18T00:00:00,1/6/15 9:30,1/6/15 23:59,NaN,potus,west wing,JointService Military Honor Guard
2,Bradley T. Guiles,2014-12-18T00:00:00,1/6/15 9:30,1/6/15 23:59,NaN,potus,west wing,JointService Military Honor Guard
3,Loryn F. Grieb,2014-12-18T00:00:00,1/6/15 9:30,1/6/15 23:59,NaN,potus,west wing,JointService Military Honor Guard
4,Travis D. Gordon,2014-12-18T00:00:00,1/6/15 9:30,1/6/15 23:59,NaN,potus,west wing,JointService Military Honor Guard
...,...,...,...,...,...,...,...,...
580,Ryan J. Morgan,2015-01-09T00:00:00,1/16/15 10:00,1/16/15 23:59,NaN,potus,west wing,military honor guard
581,Alexander V. Nevsky,2015-01-09T00:00:00,1/16/15 10:00,1/16/15 23:59,NaN,potus,west wing,military honor guard
582,Montana J. Johnson,2015-01-09T00:00:00,1/16/15 10:00,1/16/15 23:59,NaN,potus,west wing,military honor guard
583,Joseph A. Pritchard,2015-01-09T00:00:00,1/16/15 10:00,1/16/15 23:59,NaN,potus,west wing,military honor guard
584,Martin O. Reina,2015-01-09T00:00:00,1/16/15 10:00,1/16/15 23:59,NaN,potus,west wing,military honor guard

In [60]:
df.shape

(585, 8)

In [61]:
df.info

<bound method DataFrame.info of                     name appointment_made_date app_start_date   app_end_date  \
0      Joshua T. Blanton   2014-12-18T00:00:00    1/6/15 9:30   1/6/15 23:59
1        Jack T. Gutting   2014-12-18T00:00:00    1/6/15 9:30   1/6/15 23:59
2      Bradley T. Guiles   2014-12-18T00:00:00    1/6/15 9:30   1/6/15 23:59
3         Loryn F. Grieb   2014-12-18T00:00:00    1/6/15 9:30   1/6/15 23:59
4       Travis D. Gordon   2014-12-18T00:00:00    1/6/15 9:30   1/6/15 23:59
..                   ...                   ...            ...            ...
580       Ryan J. Morgan   2015-01-09T00:00:00  1/16/15 10:00  1/16/15 23:59
581  Alexander V. Nevsky   2015-01-09T00:00:00  1/16/15 10:00  1/16/15 23:59
582   Montana J. Johnson   2015-01-09T00:00:00  1/16/15 10:00  1/16/15 23:59
583  Joseph A. Pritchard   2015-01-09T00:00:00  1/16/15 10:00  1/16/15 23:59
584      Martin O. Reina   2015-01-09T00:00:00  1/16/15 10:00  1/16/15 23:59

    visitee_namelast visitee_namefirst meeting_room  \
0                NaN             potus    west wing
1                NaN             potus    west wing
2                NaN             potus    west wing
3                NaN             potus    west wing
4                NaN             potus    west wing
..               ...               ...          ...
580              NaN             potus    west wing
581              NaN             potus    west wing
582              NaN             potus    west wing
583              NaN             potus    west wing
584              NaN             potus    west wing

                           description
0    JointService Military Honor Guard
1    JointService Military Honor Guard
2    JointService Military Honor Guard
3    JointService Military Honor Guard
4    JointService Military Honor Guard
..                                 ...
580               military honor guard
581               military honor guard
582               military honor guard
583               military honor guard
584               military honor guard

[585 rows x 8 columns]>

In [63]:
df.dtypes

name                     object
appointment_made_date    object
app_start_date           object
app_end_date             object
visitee_namelast         object
visitee_namefirst        object
meeting_room             object
description              object
dtype: object

In [64]:
df

,name,appointment_made_date,app_start_date,app_end_date,visitee_namelast,visitee_namefirst,meeting_room,description
0,Joshua T. Blanton,2014-12-18T00:00:00,1/6/15 9:30,1/6/15 23:59,NaN,potus,west wing,JointService Military Honor Guard
1,Jack T. Gutting,2014-12-18T00:00:00,1/6/15 9:30,1/6/15 23:59,NaN,potus,west wing,JointService Military Honor Guard
2,Bradley T. Guiles,2014-12-18T00:00:00,1/6/15 9:30,1/6/15 23:59,NaN,potus,west wing,JointService Military Honor Guard
3,Loryn F. Grieb,2014-12-18T00:00:00,1/6/15 9:30,1/6/15 23:59,NaN,potus,west wing,JointService Military Honor Guard
4,Travis D. Gordon,2014-12-18T00:00:00,1/6/15 9:30,1/6/15 23:59,NaN,potus,west wing,JointService Military Honor Guard
...,...,...,...,...,...,...,...,...
580,Ryan J. Morgan,2015-01-09T00:00:00,1/16/15 10:00,1/16/15 23:59,NaN,potus,west wing,military honor guard
581,Alexander V. Nevsky,2015-01-09T00:00:00,1/16/15 10:00,1/16/15 23:59,NaN,potus,west wing,military honor guard
582,Montana J. Johnson,2015-01-09T00:00:00,1/16/15 10:00,1/16/15 23:59,NaN,potus,west wing,military honor guard
583,Joseph A. Pritchard,2015-01-09T00:00:00,1/16/15 10:00,1/16/15 23:59,NaN,potus,west wing,military honor guard
584,Martin O. Reina,2015-01-09T00:00:00,1/16/15 10:00,1/16/15 23:59,NaN,potus,west wing,military honor guard

In [65]:
df.loc[0,'name']

'Joshua T. Blanton'